# Pandas: Intermediate (Part 2)

## Sorting DataFrames with sort_index() and sort_values()

In [1]:
import pandas as pd

In [2]:
titanic = pd.read_csv("titanic.csv")

In [3]:
titanic.head()

   survived  pclass     sex   age  sibsp  parch     fare embarked deck
0         0       3    male  22.0      1      0   7.2500        S  NaN
1         1       1  female  38.0      1      0  71.2833        C    C
2         1       3  female  26.0      0      0   7.9250        S  NaN
3         1       1  female  35.0      1      0  53.1000        S    C
4         0       3    male  35.0      0      0   8.0500        S  NaN

In [4]:
titanic.tail()

     survived  pclass     sex   age  sibsp  parch   fare embarked deck
886         0       2    male  27.0      0      0  13.00        S  NaN
887         1       1  female  19.0      0      0  30.00        S    B
888         0       3  female   NaN      1      2  23.45        S  NaN
889         1       1    male  26.0      0      0  30.00        C    C
890         0       3    male  32.0      0      0   7.75        Q  NaN

In [5]:
titanic.age.sort_values()

803    0.42
755    0.67
644    0.75
469    0.75
78     0.83
       ...
859     NaN
863     NaN
868     NaN
878     NaN
888     NaN
Name: age, Length: 891, dtype: float64

In [6]:
titanic.sort_values("age")

     survived  pclass     sex   age  sibsp  parch     fare embarked deck
803         1       3    male  0.42      0      1   8.5167        C  NaN
755         1       2    male  0.67      1      1  14.5000        S  NaN
644         1       3  female  0.75      2      1  19.2583        C  NaN
469         1       3  female  0.75      2      1  19.2583        C  NaN
78          1       2    male  0.83      0      2  29.0000        S  NaN
..        ...     ...     ...   ...    ...    ...      ...      ...  ...
859         0       3    male   NaN      0      0   7.2292        C  NaN
863         0       3  female   NaN      8      2  69.5500        S  NaN
868         0       3    male   NaN      0      0   9.5000        S  NaN
878         0       3    male   NaN      0      0   7.8958        S  NaN
888         0       3  female   NaN      1      2  23.4500        S  NaN

[891 rows x 9 columns]

In [ ]:
titanic.head()

In [ ]:
titanic.sort_values("age", axis = 0, ascending = True, inplace = True)

In [ ]:
titanic.head()

In [ ]:
titanic.sort_values(["pclass", "sex", "age"], ascending = [True, False, True], inplace= True)

In [ ]:
titanic.head()

In [ ]:
titanic.tail()

In [ ]:
titanic.sort_index(ascending=True, inplace = True)

In [ ]:
titanic.head()

## nunique(), nlargest() and nsmallest() with DataFrames

In [ ]:
import pandas as pd

In [ ]:
titanic = pd.read_csv("titanic.csv")

In [ ]:
titanic.head()

In [ ]:
titanic.tail()

In [ ]:
titanic.age.unique()

In [ ]:
titanic.nunique(axis = 1, dropna=False)

In [ ]:
titanic.nunique(dropna = False)

In [ ]:
titanic.nlargest(n = 5, columns = "fare")

In [ ]:
titanic.sort_values("fare", ascending = False).head(5)

In [ ]:
titanic.nsmallest(n = 1, columns = "age")

In [ ]:
titanic.loc[titanic.age.idxmin()]

## Filtering DataFrames with one Condition

In [ ]:
import pandas as pd

In [ ]:
titanic = pd.read_csv("titanic.csv")

In [ ]:
titanic.head(10)

In [ ]:
titanic.sex.head(10)

In [7]:
titanic.sex == "male"

0       True
1      False
2      False
3      False
4       True
       ...
886     True
887    False
888    False
889     True
890     True
Name: sex, Length: 891, dtype: bool

In [18]:
titanic[titanic.sex == "male"]["fare"]

0       7.2500
4       8.0500
5       8.4583
6      51.8625
7      21.0750
        ...
883    10.5000
884     7.0500
886    13.0000
889    30.0000
890     7.7500
Name: fare, Length: 577, dtype: float64

In [17]:
titanic.loc[titanic.sex == "male", "fare"]

0       7.2500
4       8.0500
5       8.4583
6      51.8625
7      21.0750
        ...
883    10.5000
884     7.0500
886    13.0000
889    30.0000
890     7.7500
Name: fare, Length: 577, dtype: float64

In [ ]:
mask1 = titanic.sex == "male"
mask1

In [ ]:
titanic_male = titanic.loc[mask1]

In [ ]:
titanic_male.head()

In [ ]:
titanic.dtypes# == object

In [ ]:
mask2 = titanic.dtypes == object
mask2

In [ ]:
titanic.loc[:, ~mask2]

In [ ]:
titanic.loc[mask1, ~mask2]

## Filtering DataFrames with many Conditions (AND)

In [ ]:
import pandas as pd

In [ ]:
titanic = pd.read_csv("titanic.csv")

In [ ]:
titanic.head(10)

In [ ]:
mask1 = titanic.sex == "male"
mask1.head()

In [ ]:
mask2 = titanic.age > 14
mask2.head()

In [ ]:
(mask1 & mask2).head()

In [ ]:
male_adult = titanic.loc[mask1 % mask2, ["survived", "pclass", "sex", "age"]]
male_adult.head(20)

In [ ]:
male_adult.info()

In [ ]:
male_adult.describe()

In [ ]:
titanic.describe()

## Filtering DataFrames with many Conditions (OR)

In [10]:
import pandas as pd

In [11]:
titanic = pd.read_csv("titanic.csv")

In [12]:
titanic.head()

   survived  pclass     sex   age  sibsp  parch     fare embarked deck
0         0       3    male  22.0      1      0   7.2500        S  NaN
1         1       1  female  38.0      1      0  71.2833        C    C
2         1       3  female  26.0      0      0   7.9250        S  NaN
3         1       1  female  35.0      1      0  53.1000        S    C
4         0       3    male  35.0      0      0   8.0500        S  NaN

In [13]:
mask1 = titanic.sex == "female"
mask1.head(20)

0     False
1      True
2      True
3      True
4     False
5     False
6     False
7     False
8      True
9      True
10     True
11     True
12    False
13    False
14     True
15     True
16    False
17    False
18     True
19     True
Name: sex, dtype: bool

In [14]:
mask2 = titanic.age < 14
mask2.head(20)

0     False
1     False
2     False
3     False
4     False
5     False
6     False
7      True
8     False
9     False
10     True
11    False
12    False
13    False
14    False
15    False
16     True
17    False
18    False
19    False
Name: age, dtype: bool

In [15]:
(mask1 | mask2).head(11)

0     False
1      True
2      True
3      True
4     False
5     False
6     False
7      True
8      True
9      True
10     True
dtype: bool

In [16]:
titanic.loc[mask1 | mask2]

     survived  pclass     sex   age  sibsp  parch     fare embarked deck
1           1       1  female  38.0      1      0  71.2833        C    C
2           1       3  female  26.0      0      0   7.9250        S  NaN
3           1       1  female  35.0      1      0  53.1000        S    C
7           0       3    male   2.0      3      1  21.0750        S  NaN
8           1       3  female  27.0      0      2  11.1333        S  NaN
..        ...     ...     ...   ...    ...    ...      ...      ...  ...
880         1       2  female  25.0      0      1  26.0000        S  NaN
882         0       3  female  22.0      0      0  10.5167        S  NaN
885         0       3  female  39.0      0      5  29.1250        Q  NaN
887         1       1  female  19.0      0      0  30.0000        S    B
888         0       3  female   NaN      1      2  23.4500        S  NaN

[351 rows x 9 columns]

In [19]:
wom_or_chi = titanic.loc[mask1 | mask2, ["survived", "pclass", "sex", "age"]]

In [20]:
wom_or_chi.head()

   survived  pclass     sex   age
1         1       1  female  38.0
2         1       3  female  26.0
3         1       1  female  35.0
7         0       3    male   2.0
8         1       3  female  27.0

In [21]:
wom_or_chi.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 351 entries, 1 to 888
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   survived  351 non-null    int64
 1   pclass    351 non-null    int64
 2   sex       351 non-null    object
 3   age       298 non-null    float64
dtypes: float64(1), int64(2), object(1)
memory usage: 13.7+ KB

In [22]:
wom_or_chi.describe()

         survived      pclass         age
count  351.000000  351.000000  298.000000
mean     0.723647    2.205128   25.039161
std      0.447832    0.847232   15.314631
min      0.000000    1.000000    0.420000
25%      0.000000    1.000000   14.125000
50%      1.000000    2.000000   24.000000
75%      1.000000    3.000000   35.000000
max      1.000000    3.000000   63.000000

In [ ]:
titanic.describe()

## Advanced Filtering with between(), isin() and ~

In [ ]:
import pandas as pd

In [ ]:
summer = pd.read_csv("summer.csv")

In [ ]:
summer.head()

In [ ]:
og_1988 = summer.loc[summer.Year == 1988]

In [ ]:
og_1988.head()

In [ ]:
og_1988.tail()

In [ ]:
og_1988.info()

In [ ]:
og_since1992 = summer.loc[summer.Year >= 1992]

In [ ]:
og_since1992.head()

In [ ]:
og_since1992.tail()

In [ ]:
summer.Year.between(1960, 1969).head()

In [ ]:
og_60s = summer.loc[summer.Year.between(1960, 1969, inclusive=True)]

In [ ]:
og_60s.head()

In [ ]:
og_60s.tail()

In [ ]:
my_favourite_games = [1972, 1996]

In [ ]:
summer.Year.isin(my_favourite_games).head()

In [ ]:
og_72_96 = summer.loc[summer.Year.isin(my_favourite_games)]

In [ ]:
og_72_96.head()

In [ ]:
og_72_96.tail()

In [ ]:
og_not_72_96 = summer.loc[~summer.Year.isin(my_favourite_games)]

In [ ]:
og_not_72_96.head()

In [ ]:
og_not_72_96.Year.unique()

## any() and all()

In [ ]:
import pandas as pd

In [ ]:
titanic = pd.read_csv("titanic.csv")

In [ ]:
titanic.head()

In [ ]:
titanic.sex == "male"

In [ ]:
(titanic.sex == "male").any()

In [ ]:
(titanic.sex == "male").all()

In [ ]:
(titanic.age == 80.0).any()

In [ ]:
pd.Series([-1, 0.5 , 1, -0.1, 0]).any()

In [ ]:
titanic.fare.all()